print("--------------------")
print("12月份各种服饰销售名单表")
print("日期	服装名称	价格/件	库存数量	销售量/每日")
print("1号	    羽绒服	253.6   500	    10")
print("2号	    牛仔裤	86.3	600 	60")
print("3号	    风衣	    96.8	335	    43")
print("4号	    皮草	    135.9	855 	63")
print("5号	    T血	    65.8	632 	63")
print("6号	    衬衫	    49.3	562 	120")
print("7号	    牛仔裤	86.3	600 	72")
print("8号	    羽绒服	253.6	500 	69")
print("9号	    牛仔裤	86.3	600 	35")
print("10号	羽绒服	253.6	500 	140")
print("11号	牛仔裤	86.3	600 	90")
print("12号	皮草  	135.9	855 	24")
print("13号	T血 	65.8	632 	45")
print("14号	风衣 	96.8	335 	25")
print("15号	牛仔裤 	86.3	600 	60")
print("16号	T血 	65.8	632 	129")
print("17号	羽绒服 	253.6	500 	10")
print("18号	风衣 	96.8	335 	43")
print("19号	T血 	65.8	632 	63")
print("20号	牛仔裤 	86.3	600 	60")
print("21号	皮草 	135.9	855 	63")
print("22号	风衣 	96.8	335 	60")
print("23号	T血 	65.8	632 	58")
print("24号	牛仔裤 	86.3	600 	140")
print("25号	T血 	65.8	632 	48")
print("26号	风衣 	96.8	335 	43")
print("27号	皮草 	135.9	855 	57")
print("28号	羽绒服 	253.6	500 	10")
print("29号	T血 	65.8	632 	63")
print("30号	风衣 	96.8	335 	78")
价格 = [253.6, 86.3, 96.8, 135.9, 65.8, 49.3, 86.3, 253.6, 86.3, 253.6, 86.3, 135.9, 65.8, 96.8, 86.3, 65.8, 253.6,
      96.8, 65.8, 86.3, 135.9, 96.8, 65.8, 86.3, 65.8, 96.8, 135.9, 253.6, 65.8, 96.8]
销量 = [10, 60, 43, 63, 63, 120, 72, 69, 35, 140, 90, 24, 45, 25, 60, 129, 10, 43, 63, 60, 63, 60, 58, 140, 48, 43,
      57, 10, 63, 78]
总销售额_ = map(lambda x, y: x*y, 价格, 销量)
总销售额 = list(总销售额_)
总额 = sum(总销售额)
print(f"\n本月份销售总额为："'%.1f' % 总额)

平均每日销售数量 = sum(销量)/30
print(f"\n平均每日销售数量为:" '%.1f' % 平均每日销售数量)

T恤销量 = [63, 45, 129, 63, 58, 48, 63]
T恤月销量占比为 = sum(T恤销量)/sum(销量)
T恤月销量百分比 = format(T恤月销量占比为, '2%')
print(f"\nT恤月销量占比为:", T恤月销量百分比)

衬衫 = format(120/562, '2%')
print("衬衫月销售占比为:", 衬衫)

风衣销量 = [43, 25, 43, 60, 43, 78]
风衣销量占比 = sum(风衣销量)/sum(销量)
风衣销量月占比 = format(风衣销量占比, '2%')
print(f"风衣月销量占比为:", 风衣销量月占比)

牛仔裤销量 = [6, 72, 35, 90, 60, 60, 140]
牛仔裤销量占比 = sum(牛仔裤销量)/sum(销量)
牛仔裤销量月占比 = format(牛仔裤销量占比, '2%')
print(f"牛仔裤月销量占比为:", 牛仔裤销量月占比)

羽绒服销量 = [10, 69, 140, 10, 10]
羽绒服销量占比 = sum(羽绒服销量)/sum(销量)
羽绒服销量月占比 = format(羽绒服销量占比, '2%')
print(f"羽绒服月销量占比为:", 羽绒服销量月占比)

皮草销量 = [63, 24, 63, 57]
皮草销量占比 = sum(皮草销量)/sum(销量)
皮草销量月占比 = format(皮草销量占比, '2%')
print(f"皮草月销量占比为:", 皮草销量月占比)

